Reports/КонтролируемыеСделкиДляВключенияВУведомление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Report>
		<Properties>
			<Name>КонтролируемыеСделкиДляВключенияВУведомление</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Уведомление</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОКонтролируемыхСделках</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетныйГод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ДоговорыУчастниковКонтролируемыхСделок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ДоговорыУчастниковКонтролируемыхСделок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КодНаименованияСделки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОпределенияЦеныСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОпределенияЦенКонтролируемыхСделок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СделкаОблагаетсяЕНВД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СделкаОтноситсяКДеятельностиНовогоМорскогоМесторождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодУсловийПоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПредметыКонтролируемыхСделок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ПредметыКонтролируемыхСделок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЯвляетсяТоваромМировойБиржевойТорговли</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОблагаетсяНДПИПоПроцентнойСтавке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоТНВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКВЭД2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКПД2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПредметСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыСтроительства</v8:Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
						<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыВзаимозависимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ТипыВзаимозависимости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеВзаимозависимы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзаимозависимыПоКодексу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СамостоятельноеПризнаниеВзаимозависимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзаимозависимостьПоРешениюСуда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВзаимозависимыйПосредник</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УведомлениеОКонтролируемыхСделках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>УведомлениеОКонтролируемыхСделках</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.КонтролируемыеСделкиОрганизаций</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетныйГод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКорректировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияУведомления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФормированияСпискаСделок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаполненияУведомления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМестаПредставления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппироватьСделкиСОдинаковойЦеной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодФормыРеорганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННРеорганизованнойОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КППРеорганизованнойОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/КонтролируемыеСделкиДляВключенияВУведомление/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДокументРезультат.Очистить();
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Документы.УведомлениеОКонтролируемыхСделках.ПолучитьВременныеТаблицыДляЗаполненияУведомления(Уведомление);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтролируемыеСделки.Организация КАК Организация,
	|	КонтролируемыеСделки.ОтчетныйГод КАК ОтчетныйГод,
	|	КонтролируемыеСделки.ГоловнойКонтрагент КАК Контрагент,
	|	КонтролируемыеСделки.Контрагент КАК ОбособленноеПодразделениеКонтрагента,
	|	КонтролируемыеСделки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	КонтролируемыеСделки.ПредметСделки КАК ПредметСделки,
	|	КонтролируемыеСделки.СделкаВнешнейТорговлиТоваромМировойБиржевойТорговли КАК СделкаВнешнейТорговлиТоваромМировойБиржевойТорговли,
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) КАК СуммаБезНДСВРублях,
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ КАК КонтрагентЗарегистрированВРФ,
	|	КонтролируемыеСделки.ЗарегистрированВСтранеСЛьготнымНалогообложением КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	КонтролируемыеСделки.ТипВзаимозависимости КАК ТипВзаимозависимости,
	|	КонтролируемыеСделки.СделкаОблагаетсяЕНВД КАК СделкаОблагаетсяЕНВД,
	|	КонтролируемыеСделки.СделкаСПлательщикомЕСХН КАК СделкаСПлательщикомЕСХН,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоНалогуНаПрибыль КАК СделкаКонтролируетсяПоНалогуНаПрибыль,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоНДПИ КАК СделкаКонтролируетсяПоНДПИ,
	|	ДоговорыУчастниковКонтролируемыхСделок.КодУсловийПоставки КАК КодУсловийПоставки,
	|	ДоговорыУчастниковКонтролируемыхСделок.СпособОпределенияЦеныСделки КАК СпособОпределенияЦеныСделки,
	|	ДоговорыУчастниковКонтролируемыхСделок.КодНаименованияСделки КАК КодНаименованияСделки,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА КонтролируемыеСделки.ЗарегистрированВСтранеСЛьготнымНалогообложением
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА КонтролируемыеСделки.СделкаВнешнейТорговлиТоваромМировойБиржевойТорговли
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА КонтролируемыеСделки.СделкаОблагаетсяЕНВД
	|					ТОГДА 0.5
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА КонтролируемыеСделки.СделкаСПлательщикомЕСХН
	|					ТОГДА 0.5
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА КонтролируемыеСделки.СделкаКонтролируетсяПоНалогуНаПрибыль
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА КонтролируемыеСделки.СделкаКонтролируетсяПоРегистрацииВОЭЗ
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА КонтролируемыеСделки.СделкаКонтролируетсяПоНДПИ
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА КонтролируемыеСделки.СтороныВзаимозависимыПоКодексу
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА КонтролируемыеСделки.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимыйПосредник)
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА КонтрагентыКонтролируемыеПоОбщейСумме.ГоловнойКонтрагент ЕСТЬ NULL 
	|					ТОГДА 0
	|				ИНАЧЕ 1
	|			КОНЕЦ > 1
	|			ТОГДА ""1""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА КонтролируемыеСделки.СделкаВнешнейТорговлиТоваромМировойБиржевойТорговли
	|					ТОГДА ""2""
	|				КОГДА КонтролируемыеСделки.СделкаОблагаетсяЕНВД
	|						ИЛИ КонтролируемыеСделки.СделкаСПлательщикомЕСХН
	|					ТОГДА ""3""
	|				КОГДА КонтролируемыеСделки.СделкаКонтролируетсяПоНалогуНаПрибыль
	|					ТОГДА ""4""
	|				КОГДА КонтролируемыеСделки.СделкаКонтролируетсяПоРегистрацииВОЭЗ
	|					ТОГДА ""5""
	|				КОГДА КонтролируемыеСделки.СделкаКонтролируетсяПоНДПИ
	|					ТОГДА ""6""
	|				КОГДА КонтролируемыеСделки.ЗарегистрированВСтранеСЛьготнымНалогообложением
	|					ТОГДА ""7""
	|				КОГДА КонтролируемыеСделки.СтороныВзаимозависимыПоКодексу
	|					ТОГДА ""8""
	|				КОГДА КонтролируемыеСделки.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимыйПосредник)
	|					ТОГДА ""9""
	|				КОГДА НЕ КонтрагентыКонтролируемыеПоОбщейСумме.ГоловнойКонтрагент ЕСТЬ NULL 
	|					ТОГДА ""10""
	|			КОНЕЦ
	|	КОНЕЦ КАК ПричинаПопаданияВКонтролируемыеСделки,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоРегистрацииВОЭЗ КАК СделкаКонтролируетсяПоРегистрацииВОЭЗ,
	|	КонтролируемыеСделки.СтороныВзаимозависимыПоКодексу,
	|	ВЫБОР
	|		КОГДА КонтролируемыеСделки.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимыйПосредник)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НеВзаимозависимыйПосредник,
	|	ВЫБОР
	|		КОГДА НЕ КонтрагентыПоМинимальнойСумме.ГоловнойКонтрагент ЕСТЬ NULL 
	|				И (КонтролируемыеСделки.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимыйПосредник)
	|					ИЛИ КонтролируемыеСделки.СтороныВзаимозависимыПоКодексу
	|						И НЕ КонтролируемыеСделки.КонтрагентЗарегистрированВРФ
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоОбщейСумме.ГоловнойКонтрагент ЕСТЬ NULL 
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоНДПИ.ГоловнойКонтрагент ЕСТЬ NULL 
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоСпецРежиму.ГоловнойКонтрагент ЕСТЬ NULL 
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоПрибыли.ГоловнойКонтрагент ЕСТЬ NULL 
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоОЭЗ.ГоловнойКонтрагент ЕСТЬ NULL 
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоРегистрацииНеВРФ.ГоловнойКонтрагент ЕСТЬ NULL )
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СделкаПопалаВУведомление,
	|	ВЫБОР
	|		КОГДА КонтрагентыКонтролируемыеПоОбщейСумме.ГоловнойКонтрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СуммаДоходовПоСделкеПревышаетОбщийПредел
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоОбщейСумме КАК КонтрагентыКонтролируемыеПоОбщейСумме
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоОбщейСумме.ГоловнойКонтрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоНДПИ КАК КонтрагентыКонтролируемыеПоНДПИ
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоНДПИ.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаКонтролируетсяПоНДПИ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоСпецРежиму КАК КонтрагентыКонтролируемыеПоСпецРежиму
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоСпецРежиму.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаОблагаетсяЕНВД
	|				ИЛИ КонтролируемыеСделки.СделкаСПлательщикомЕСХН)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоПрибыли КАК КонтрагентыКонтролируемыеПоПрибыли
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоПрибыли.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаКонтролируетсяПоНалогуНаПрибыль)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоОЭЗ КАК КонтрагентыКонтролируемыеПоОЭЗ
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоОЭЗ.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаКонтролируетсяПоРегистрацииВОЭЗ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоРегистрацииНеВРФ КАК КонтрагентыКонтролируемыеПоРегистрацииНеВРФ
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоРегистрацииНеВРФ.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.ЗарегистрированВСтранеСЛьготнымНалогообложением
	|				ИЛИ КонтролируемыеСделки.СделкаВнешнейТорговлиТоваромМировойБиржевойТорговли)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДоговорыУчастниковКонтролируемыхСделок КАК ДоговорыУчастниковКонтролируемыхСделок
	|		ПО КонтролируемыеСделки.Организация = ДоговорыУчастниковКонтролируемыхСделок.Организация
	|			И КонтролируемыеСделки.Контрагент = ДоговорыУчастниковКонтролируемыхСделок.Контрагент
	|			И КонтролируемыеСделки.ДоговорКонтрагента = ДоговорыУчастниковКонтролируемыхСделок.ДоговорКонтрагента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредметыКонтролируемыхСделок КАК ПредметыКонтролируемыхСделок
	|		ПО КонтролируемыеСделки.ПредметСделки = ПредметыКонтролируемыхСделок.ПредметСделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыПоМинимальнойСумме КАК КонтрагентыПоМинимальнойСумме
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыПоМинимальнойСумме.ГоловнойКонтрагент
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.ГоловнойКонтрагент,
	|	КонтролируемыеСделки.Контрагент,
	|	КонтролируемыеСделки.ДоговорКонтрагента,
	|	КонтролируемыеСделки.ПредметСделки,
	|	КонтролируемыеСделки.Организация,
	|	КонтролируемыеСделки.ОтчетныйГод,
	|	КонтролируемыеСделки.СделкаВнешнейТорговлиТоваромМировойБиржевойТорговли,
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ,
	|	КонтролируемыеСделки.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	КонтролируемыеСделки.ТипВзаимозависимости,
	|	КонтролируемыеСделки.СделкаОблагаетсяЕНВД,
	|	КонтролируемыеСделки.СделкаСПлательщикомЕСХН,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоНалогуНаПрибыль,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоНДПИ,
	|	ДоговорыУчастниковКонтролируемыхСделок.КодУсловийПоставки,
	|	ДоговорыУчастниковКонтролируемыхСделок.СпособОпределенияЦеныСделки,
	|	ДоговорыУчастниковКонтролируемыхСделок.КодНаименованияСделки,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоРегистрацииВОЭЗ,
	|	КонтролируемыеСделки.СтороныВзаимозависимыПоКодексу,
	|	ВЫБОР
	|		КОГДА КонтролируемыеСделки.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимыйПосредник)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КонтрагентыКонтролируемыеПоОбщейСумме.ГоловнойКонтрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА КонтролируемыеСделки.ЗарегистрированВСтранеСЛьготнымНалогообложением
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА КонтролируемыеСделки.СделкаВнешнейТорговлиТоваромМировойБиржевойТорговли
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА КонтролируемыеСделки.СделкаОблагаетсяЕНВД
	|					ТОГДА 0.5
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА КонтролируемыеСделки.СделкаСПлательщикомЕСХН
	|					ТОГДА 0.5
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА КонтролируемыеСделки.СделкаКонтролируетсяПоНалогуНаПрибыль
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА КонтролируемыеСделки.СделкаКонтролируетсяПоРегистрацииВОЭЗ
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА КонтролируемыеСделки.СделкаКонтролируетсяПоНДПИ
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА КонтролируемыеСделки.СтороныВзаимозависимыПоКодексу
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА КонтролируемыеСделки.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимыйПосредник)
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА КонтрагентыКонтролируемыеПоОбщейСумме.ГоловнойКонтрагент ЕСТЬ NULL 
	|					ТОГДА 0
	|				ИНАЧЕ 1
	|			КОНЕЦ > 1
	|			ТОГДА ""1""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА КонтролируемыеСделки.СделкаВнешнейТорговлиТоваромМировойБиржевойТорговли
	|					ТОГДА ""2""
	|				КОГДА КонтролируемыеСделки.СделкаОблагаетсяЕНВД
	|						ИЛИ КонтролируемыеСделки.СделкаСПлательщикомЕСХН
	|					ТОГДА ""3""
	|				КОГДА КонтролируемыеСделки.СделкаКонтролируетсяПоНалогуНаПрибыль
	|					ТОГДА ""4""
	|				КОГДА КонтролируемыеСделки.СделкаКонтролируетсяПоРегистрацииВОЭЗ
	|					ТОГДА ""5""
	|				КОГДА КонтролируемыеСделки.СделкаКонтролируетсяПоНДПИ
	|					ТОГДА ""6""
	|				КОГДА КонтролируемыеСделки.ЗарегистрированВСтранеСЛьготнымНалогообложением
	|					ТОГДА ""7""
	|				КОГДА КонтролируемыеСделки.СтороныВзаимозависимыПоКодексу
	|					ТОГДА ""8""
	|				КОГДА КонтролируемыеСделки.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимыйПосредник)
	|					ТОГДА ""9""
	|				КОГДА НЕ КонтрагентыКонтролируемыеПоОбщейСумме.ГоловнойКонтрагент ЕСТЬ NULL 
	|					ТОГДА ""10""
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ КонтрагентыПоМинимальнойСумме.ГоловнойКонтрагент ЕСТЬ NULL 
	|				И (КонтролируемыеСделки.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимыйПосредник)
	|					ИЛИ КонтролируемыеСделки.СтороныВзаимозависимыПоКодексу
	|						И НЕ КонтролируемыеСделки.КонтрагентЗарегистрированВРФ
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоОбщейСумме.ГоловнойКонтрагент ЕСТЬ NULL 
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоНДПИ.ГоловнойКонтрагент ЕСТЬ NULL 
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоСпецРежиму.ГоловнойКонтрагент ЕСТЬ NULL 
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоПрибыли.ГоловнойКонтрагент ЕСТЬ NULL 
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоОЭЗ.ГоловнойКонтрагент ЕСТЬ NULL 
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоРегистрацииНеВРФ.ГоловнойКонтрагент ЕСТЬ NULL )
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("КонтролируемыеСделки", Таблица);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки);
	
	//Создадим и инициализируем процессор компоновки
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных);
	
	//Создадим и инициализируем процессор вывода результата
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	

КонецПроцедуры
